# -- coding: utf-8 --

import asyncio
from vk_api.longpoll import VkLongPoll, VkEventType
from vk_api.keyboard import VkKeyboard, VkKeyboardColor
import vk_api
from datetime import datetime
import random
import json
import time
import sqlite3



print('')
print('-------------------------------')
print('  Скрипт Бот Ютубер запущен.')
print('  Разработчик: Кирилл Арзамасцев ')
print('  https://vk.com/kirillarz')

print('-------------------------------')
print('')



# вписываем свой токен
token = "1b464e0c8f92ffaef1fa2b921bdd396d2062014bef32657eb1e7b62aa0d4fb36a2555fb5e6383cbadcfc4"
vk_session = vk_api.VkApi(token=token)

# тип авторизация
session_api = vk_session.get_api()
longpoll    = VkLongPoll(vk_session)


inventory   = {}
id_admin    = 457641188
# приветствия
greetings = ['привет', 'здарова', 'ку', 'салам', 'hi', 'хай', 'бонжур', 'здравствуй', 'здравствуйте','добрый день', 'добрый вечер','доброе утро', 'салют','приветик'] 
# смайлики
smiles = ['😀','😃','😄','😁','😆','😅','😂','🤣','☺','😊','😇','🙂','🙃','😉','😌','😜','😝','🤑','🤡','🥳','🤩''😎','🤓','🧐','🤨','🤠','😏','🥺','😑','😐','😯','😦','😧','😮','🥱','😵','😳','😱','😨','😰','😷','🤧','🤮','🥴','🤕','🤒','👿','😈','👻','💀','💩','👺','👽','👨‍💻']


rotateWord = {
    ' ': ' ',
    'q': 'q',
    'w': 'ʍ',
    'e': 'ǝ',
    'r': 'ɹ',
    't': 'ʇ',
    'y': 'ʎ',
    'u': 'u',
    'i': 'ᴉ',
    'o': 'o',
    'p': 'p',
    'a': 'ɐ',
    's': 's',
    'd': 'd',
    'f': 'ɟ',
    'g': 'ƃ',
    'h': 'ɥ',
    'j': 'ɾ',
    'k': 'ʞ',
    'l': 'l',
    'z': 'z',
    'x': 'x',
    'c': 'ɔ',
    'v': 'ʌ',
    'b': 'b',
    'n': 'n',
    'm': 'ɯ',

    'й': 'ņ',
    'ц': 'ǹ',
    'у': 'ʎ',
    'к': 'ʞ',
    'е': 'ǝ',
    'н': 'н',
    'г': 'ɹ',
    'ш': 'm',
    'щ': 'm',
    'з': 'ε',
    'х': 'х',
    'ъ': 'q',
    'ф': 'ф',
    'ы': 'ıq',
    'в': 'ʚ',
    'а': 'ɐ',
    'п': 'u',
    'р': 'd',
    'о': 'о',
    'л': 'v',
    'д': 'ɓ',
    'ж': 'ж',
    'э': 'є',
    'я': 'ʁ',
    'ч': 'һ',
    'с': 'ɔ',
    'м': 'w',
    'и': 'и',
    'т': 'ɯ',
    'ь': 'q',
    'б': 'ƍ',
    'ю': 'oı'
}

translateWord = { 
    'q': 'й',
    'w': 'ц',
    'e': 'у',
    'r': 'к',
    't': 'е',
    'y': 'н',
    'u': 'г',
    'i': 'ш',
    'o': 'щ',
    'p': 'з',
    '[': 'х',
    ']': 'ъ',
    'a': 'ф',
    's': 'ы',
    'd': 'в',
    'f': 'а',
    'g': 'п',
    'h': 'р',
    'j': 'о',
    'k': 'л',
    'l': 'д',
    ';': 'ж',
    "'": 'э',
    'z': 'я',
    'x': 'ч',
    'c': 'с',
    'v': 'м',
    'b': 'и',
    'n': 'т',
    'm': 'ь',
    ',': 'б',
    '.': 'ю',
    '/': '.',
    ' ': ' ',
    '1': '1',
    '2': '2',
    '3': '3',
    '4': '4',
    '5': '5',
    '6': '6',
    '7': '7',
    '8': '8',
    '9': '9',
    '0': '0',
    '-': '-',
    '=': '='
}









conn = sqlite3.connect("database.db")
cursor = conn.cursor()
 
# Создание таблицы
cursor.execute("CREATE TABLE userdata (id INT, balance BIGINT, nick NCHAR, admin BIT, city NCHAR)" )

